blog/app/controllers/comments_controller.rb

def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(params[:comment].permit(:commenter, :body))
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("body", "commenter", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "Says JUMP"], ["commenter", "Simon"], ["created_at", Thu, 19 Sep 2013 19:17:14 UTC +00:00], ["post_id", 1], ["updated_at", Thu, 19 Sep 2013 19:17:14 UTC +00:00]]